In [1]:
import re
from glob import iglob
import datetime
import pandas as pd
import matplotlib.pyplot as plt
from pyspark.shell import sqlContext

Welcome to
      ____              __
     / __/__  ___ _____/ /__
    _\ \/ _ \/ _ `/ __/  '_/
   /__ / .__/\_,_/_/ /_/\_\   version 2.4.3
      /_/

Using Python version 3.7.3 (default, Mar 27 2019 09:23:15)
SparkSession available as 'spark'.

In [2]:
sqlContext.read.parquet("../data/resources/2019-09/reports/top_resources/").registerTempTable("resources")

In [3]:
def sql(sql):
    return sqlContext.sql(sql).toPandas()

In [5]:
total = sql("SELECT sum(number) as total FROM resources")

In [16]:
subset = sql("SELECT sum(number) as total FROM (SELECT * FROM resources LIMIT 1000)")

In [17]:
subset

      total
0  88236552

In [18]:
total

       total
0  158284348

In [19]:
subset['total'] / total['total']

0    0.557456
Name: total, dtype: float64